In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMschafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["First_name", "Last_name", "Email"]

In [7]:
df

  First_name Last_name                    Email
0      Corey   Schafer  CoreyMschafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [8]:
df.columns = [x.lower() for x in df.columns]; df

  first_name last_name                    email
0      Corey   Schafer  CoreyMschafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [9]:
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [10]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [11]:
df.loc[2, "last"] = "Smith"

In [12]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [13]:
df.at[2, "last"] = "Doe"

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [15]:
filt = df["email"] == "JohnDoe@gmail.com"
df[filt]["last"] = "Smith"

/var/folders/r2/9ll477s10d7gz6rx5kpl7c500000gn/T/ipykernel_62896/3206338516.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]["last"] = "Smith"

In [16]:
filt = df["email"] == "JohnDoe@gmail.com"
df.loc[filt, "last"] = "Smith"

In [17]:
df["email"] = df["email"].str.lower()

In [18]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [19]:
df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [20]:
def update_email(email):
    return email.upper()

In [21]:
df["email"].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [22]:
df["email"] = df["email"].apply(update_email); df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [23]:
df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [24]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [25]:
len(df["email"])

3

In [26]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    COREYMSCHAFER@GMAIL.COM
dtype: object

In [27]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    COREYMSCHAFER@GMAIL.COM
dtype: object

In [28]:
df.map(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [29]:
df.map(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@gmail.com
2   john    smith        johndoe@gmail.com

In [30]:
#NaN occures
df["first"].map({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [31]:
df["first"].replace({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [32]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [33]:
df["email"] = df["email"].str.lower()

# Add / Remove Rows and Colums

In [34]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [35]:
df["fullname"] = df["first"] + " " + df["last"]

In [36]:
df

   first     last                    email       fullname
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John    Smith        johndoe@gmail.com     John Smith

In [37]:
df.drop(columns=["first", "last"], inplace=True)

In [38]:
df

                     email       fullname
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@gmail.com       Jane Doe
2        johndoe@gmail.com     John Smith

In [39]:
df["fullname"].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [40]:
df[["first", "last"]] = df["fullname"].str.split(" ", expand=True)

In [41]:
df

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith

## Add Row

In [42]:
df._append({"first": "Tony"}, ignore_index=True)

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith
3                      NaN            NaN   Tony      NaN

In [43]:
people = {
    "first": ["Bruce", "Peter"],
    "last": ["Wayne", "Parker"],
    "email": ["batman@vengence.com", "spiderman@hero.com"]
}

df2 = pd.DataFrame(people)

In [44]:
df2

   first    last                email
0  Bruce   Wayne  batman@vengence.com
1  Peter  Parker   spiderman@hero.com

In [45]:
df._append(df2, ignore_index=True)

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith
3      batman@vengence.com            NaN  Bruce    Wayne
4       spiderman@hero.com            NaN  Peter   Parker

In [46]:
df = df._append(df2, ignore_index=True)

In [47]:
df

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith
3      batman@vengence.com            NaN  Bruce    Wayne
4       spiderman@hero.com            NaN  Peter   Parker

In [48]:
df.drop(index=4, inplace=True)

In [49]:
df

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@gmail.com       Jane Doe   Jane      Doe
2        johndoe@gmail.com     John Smith   John    Smith
3      batman@vengence.com            NaN  Bruce    Wayne

In [50]:
filt = df["last"] == "Doe"
df.drop(index=df[filt].index)

                     email       fullname  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
2        johndoe@gmail.com     John Smith   John    Smith
3      batman@vengence.com            NaN  Bruce    Wayne

# Sorting Data

In [51]:
people = {
    "first": ["Corey", "Jane", "John", "Adam"],
    "last": ["Schafer", "Doe", "Doe", "Dow"],
    "email": ["CoreyMschafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com", "adam@gmail.com"]
}

df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
3   Adam      Dow           adam@gmail.com

In [52]:
df.sort_values(by="last", ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
3   Adam      Dow           adam@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [53]:
df.sort_values(by=["last", "first"], ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
3   Adam      Dow           adam@gmail.com
2   John      Doe        JohnDoe@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [54]:
df.sort_values(by=["last", "first"], ascending=[False, True], inplace=True)

In [55]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
3   Adam      Dow           adam@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [56]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
3   Adam      Dow           adam@gmail.com

In [57]:
df["last"].sort_values()

1        Doe
2        Doe
3        Dow
0    Schafer
Name: last, dtype: object